Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: A gas turbine engine (10; 100) comprising a compressor stage (24) having a variable geometry element (46), a combustor (14) and a turbine stage (16), and a controller (50) having a processor and a memory, the memory having stored thereon instructions executable by the processor to perform a method of controlling the geometrical configuration of the variable geometry element (46) of the compressor stage (24) of the gas turbine engine (10; 100), the method comprising:
de_de: Gasturbinenmotor (10; 100), umfassend eine Verdichterstufe (24) mit einem Element variabler Geometrie (46), eine Brennkammer (14) und eine Turbinenstufe (16) sowie eine Steuerung (50) mit einem Prozessor und einem Speicher, wobei im dem Speicher Anweisungen gespeichert sind, die von dem Prozessor ausführbar sind, um ein Verfahren zur Steuerung der geometrischen Konfiguration des Elements variabler Geometrie (46) der Verdichterstufe (24) des Gasturbinenmotors (10; 100) durchzuführen, wobei das Verfahren umfasst:

source: determining (406) whether a difference (408) between an expected value of normalized mass flow rate QHPT through a high-pressure turbine of the turbine stage and an actual value of normalized mass flow rate Qcurr through the high-pressure turbine exceeds a threshold value, wherein the actual value of normalized mass flow rate Qcurr is a function of a current value of mass flow rate Wcurr, a current value of pressure Pcurr, and a current value of temperature Tcurr through the high-pressure turbine based on the relationship
de_de: Bestimmen (406), ob eine Differenz (408) zwischen einem erwarteten Wert des normalisierten Massenstroms QHPT durch eine Hochdruckturbine der Turbinenstufe und einem tatsächlichen Wert des normalisierten Massenstroms Qcurr durch die Hochdruckturbine einen Schwellenwert überschreitet, wobei der tatsächliche Wert des normalisierten Massenstroms Qcurr eine Funktion eines aktuellen Werts des Massenstroms Wcurr, eines aktuellen Werts des Drucks Pcurr und eines aktuellen Werts der Temperatur Tcurr durch die Hochdruckturbine ist, basierend auf der Beziehung

source: determining a control parameter (52) value associated to the geometrical configuration of the variable geometry element based on the determined value of mass flow rate W; and
de_de: Bestimmen eines Werts des Steuerparameters (52), der mit der geometrischen Konfiguration des Elements mit variabler Geometrie verknüpft ist, basierend auf dem bestimmten Wert des Massenstroms W; und

source: 1. A fluid distributor for use in an injector for a gas turbine engine comprising a distributor body (102) defining a passage (112) and a second fluid distributor passage for use in a fuel injector for a gas turbine, wherein each distributor passage winds along a swirl path along a swirl axis that is aligned with the build direction, each of said first and second fluid distributor passages being produced by a process of:
de_de: 1. Fluidverteiler zur Verwendung in einem Injektor für ein Gasturbinentriebwerk, der einen Verteilerkörper (102) umfasst, der einen Kanal (112) und einen zweiten Fluidverteilerkanal zur Verwendung in einem Brennstoffinjektor für eine Gasturbine definiert, wobei sich jeder Verteilerkanal entlang eines Drallpfads entlang einer Drallachse windet, die mit der Baurichtung ausgerichtet ist, wobei jeder der ersten und zweiten Fluidverteilerkanäle hergestellt ist durch einen Prozess von:

source: additively manufacturing a floor (125), ceiling (123), and opposed sidewalls of each fluid distributor passage (112) using a build direction, wherein at least one of the floor (125) and/or the ceiling (123) define a swirl angle greater than 60 degrees relative to the build direction, wherein the swirl angle is the bulk angle, e.g. along which fluid would travel in one of the passages, taken at any position,
de_de: additivem Herstellen eines Bodens (125), einer Decke (123) und gegenüberliegender Seitenwände jedes Fluidverteilerkanals (112) mithilfe einer Baurichtung, wobei der Boden (125) und/oder die Decke (123) einen Drallwinkel von mehr als 60 Grad relativ zu der Baurichtung definiert, wobei der Drallwinkel der Hauptwinkel ist, z. B. entlang dem sich Fluid in einem der Kanäle bewegen würde, und zwar an jeder beliebigen Position,

source: wherein each of the first and second fluid distributor passages (112) defines a ceiling (123) including two surfaces (122) and (124) and an opposed floor wherein each of said ceilings (123) is vaulted into the two constituent surfaces (122, 124), wherein the ceiling is curved and characterized in that wherein each of ceilings (123) is vaulted into the two constituent surfaces (122,124) to define a local surface that is angled locally at an angle that is less than 60 degrees relative to the swirl axis,
de_de: wobei jeder der ersten und zweiten Fluidverteilerkanäle (112) eine Decke (123) mit zwei Oberflächen (122) und (124) und einem gegenüberliegenden Boden definiert, wobei jede der Decken (123) in die zwei einzelnen Oberflächen (122, 124) gewölbt ist, wobei die Decke gekrümmt ist und dadurch gekennzeichnet ist, dass jede der Decken (123) in die zwei einzelnen Oberflächen (122, 124) gewölbt ist, um eine lokale Oberfläche zu definieren, die lokal in einem Winkel von weniger als 60 Grad relativ zu der Drallachse geneigt ist,

source: wherein the two surfaces of the ceiling are both angled at the same angle α.
de_de: wobei die zwei Flächen der Decke beide um den gleichen Winkel α geneigt sind.

source: 2. The fluid distributor as recited in claim 1, wherein at least one of the floor and/or the ceiling define a swirl angle greater than 80 degrees relative to the build direction.
de_de: 2. Fluidverteiler nach Anspruch 1, wobei der Boden und/oder die Decke einen Drallwinkel von mehr als 80 Grad relativ zu der Baurichtung definiert.

source: 3. The fluid distributor as recited in claim 1 or 2, wherein at least one of the floor and/or the ceiling define a swirl angle greater than 88 degrees relative to the build direction.
de_de: 3. Fluidverteiler nach Anspruch 1 oder 2, wobei der Boden und/oder die Decke einen Drallwinkel von mehr als 88 Grad relativ zu der Baurichtung definiert.

source: 4. A method for manufacturing fluid distributor according to claim 1 comprising:
de_de: 4. Verfahren zur Herstellung eines Fluidverteilers nach Anspruch 1, umfassend:

source: additively manufacturing a first fluid distributor passage (112) and a second fluid distributor passage by additively manufacturing each fluid distributor passage (112) along a build direction, wherein each fluid distributor passage winds along a swirl path around a swirl axis that is aligned with the build direction.
de_de: Additives Herstellen eines ersten Fluidverteilerkanals (112) und eines zweiten Fluidverteilerkanals durch additives Herstellen jedes Fluidverteilerkanals (112) entlang einer Baurichtung, wobei sich jeder Fluidverteilerkanal entlang eines Drallpfads um eine Drallachse windet, die mit der Baurichtung ausgerichtet ist.

source: 5. The method as recited in claim 4, wherein the swirl angle is greater than 80 degrees relative to the build direction.
de_de: 5. Verfahren nach Anspruch 4, wobei der Drallwinkel relativ zu der Baurichtung größer als 80 Grad ist.

source: 6. The method as recited in claim 4 or 5, wherein a ceiling of the swirl path is self-supported without removable support structure during additively manufacturing the swirl path.
de_de: 6. Verfahren nach Anspruch 4 oder 5, wobei eine Decke des Drallpfads während des additiven Herstellens des Drallpfads ohne entfernbare Stützstruktur selbsttragend ist.

source: 7. A fluid distributor according to claim 1 wherein at least one of the floor is vaulted to define a surface that is angled less than 60 degrees relative to the swirl axis.
de_de: 7. Fluidverteiler nach Anspruch 1, wobei mindestens einer der Boden gewölbt ist, um eine Oberfläche zu definieren, die relativ zu der Drallachse einen Winkel von weniger als 60 Grad aufweist.

source: 8. The fluid distributor as recited in claim 7, wherein the both of the ceiling and floor are vaulted in opposite directions.
de_de: 8. Fluidverteiler nach Anspruch 7, wobei sowohl die Decke als auch der Boden in entgegengesetzter Richtung gewölbt sind.

source: 9. The fluid distributor as recited in any of claims 7 to 8, wherein the distributor passages are in fluid communication with an annular outlet within an air blast atomizer.
de_de: 9. Fluidverteiler nach einem der Ansprüche 7 bis 8, wobei die Verteilerkanäle in Fluidverbindung mit einem ringförmigen Auslass innerhalb eines Luftstoßzerstäubers stehen.

source: The fluid distributor as recited in claim 9, where the air blast atomizer includes one or both of:
de_de: Fluidverteiler nach Anspruch 9, wobei der Luftstoßzerstäuber eines oder beide der folgenden Elemente aufweist:

source: an inner air passage radially inboard of the distributor passages; and/or
de_de: einen inneren Luftkanal radial innerhalb der Verteilerkanäle; und/oder

source: an outer air passage radially outboard of the distributor passages.
de_de: einen äußeren Luftkanal radial außerhalb der Verteilerkanäle.

source: The fluid distributor as recited in any of claims 7 to 10, wherein the swirl angle is 90 degrees relative to the swirl axis.
de_de: Fluidverteiler nach einem der Ansprüche 7 bis 10, wobei der Drallwinkel 90 Grad relativ zu der Drallachse ist.

source: The fluid distributor as recited in any of claims 7 to 11, wherein the fluid distributor passages define a conical profile.
de_de: Fluidverteiler nach einem der Ansprüche 7 bis 11, wobei die Fluidverteilerkanäle ein konisches Profil definieren.

source: 1. An ignition system (12) for igniting a plurality of energetic components (16a, 16b) in a missile (10), the ignition system (12) comprising:
de_de: 1. Zündsystem (12) zum Zünden einer Vielzahl von energetischen Komponenten (16a, 16b) in einem Flugkörper (10), wobei das Zündsystem (12) umfasst:

source: a plurality of energetic initiators (20a-c) operatively coupled to a modular ignition safety device (18), the modular ignition safety device (18) including logic circuitry configured to:
de_de: eine Vielzahl von energetischen Zündern (20a-c), die mit einer modularen Zündsicherungseinrichtung (18) wirkgekoppelt sind, wobei die modulare Zündsicherungseinrichtung (18) eine Logikschaltung beinhaltet, die konfiguriert ist, um:

source: receive a flight profile mode selection input (38); and characterised in that the system is configured to
de_de: eine Flugprofilmodus-Auswahleingabe (38) zu empfangen; und dadurch gekennzeichnet, dass das System konfiguriert ist, um

source: selectively control a first sequential activation or a second sequential activation of the plurality of energetic initiators (20a-c) based on the flight profile mode selection input (38), wherein the first sequential activation includes a first time delay between the activation of each of the plurality of energetic initiators (20a-c) and the second sequential activation includes a second time delay between the activation of each of the plurality of energetic initiators (20a-c), the second time delay being greater than the first time delay.
de_de: eine ersten sequentiellen Aktivierung oder einer zweiten sequentiellen Aktivierung der Vielzahl von energetischen Zündern (20a-c) basierend auf der Flugprofilmodus-Auswahleingabe (38) selektiv zu steuern, wobei die erste sequentielle Aktivierung eine erste Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) beinhaltet und die zweite sequentielle Aktivierung eine zweite Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) beinhaltet, wobei die zweite Zeitverzögerung größer ist als die erste Zeitverzögerung.

source: 2. The ignition system (12) according to claim 1, wherein the plurality of energetic components (16a, 16b) are a plurality of pulses of a multiple pulse rocket motor, or wherein the plurality of energetic components (16a, 16b) are a plurality of stages of a multiple stage rocket motor.
de_de: 2. Zündsystem (12) nach Anspruch 1, wobei die Vielzahl von energetischen Komponenten (16a, 16b) eine Vielzahl von Impulsen eines Mehrpuls-Raketenmotors ist oder wobei die Vielzahl von energetischen Komponenten (16a, 16b) eine Vielzahl von Stufen eines Mehrstufigen-Raketenmotors ist.

source: 3. The ignition system (12) according to any one of claim 1 to claim 2, wherein the plurality of energetic initiators (20a-c) are respectively located within a plurality of capacitive discharge units.
de_de: 3. Zündsystem (12) nach einem der Ansprüche 1 bis 2, wobei die Vielzahl von energetischen Zündern (20a-c) jeweils innerhalb einer Vielzahl von kapazitiven Entladungseinheiten angeordnet ist.

source: 4. The ignition system (12) according to any one of claim 1 to claim 3, wherein the flight profile mode selection input (38) is a flight velocity input and the logic circuitry includes a flight profile selection circuit configured to receive the flight velocity input and control the first sequential activation of the plurality of energetic initiators (20a-c)
de_de: 4. Zündsystem (12) nach einem der Ansprüche 1 bis 3, wobei die Flugprofilmodus-Auswahleingabe (38) eine Fluggeschwindigkeitseingabe ist und die Logikschaltung eine Flugprofil-Auswahlschaltung beinhaltet, die konfiguriert ist, um die Fluggeschwindigkeitseingabe zu empfangen und die erste sequentielle Aktivierung der Vielzahl von energetischen Zündern (20a-c) zu steuern

source: , wherein optionally the flight profile mode selection circuit includes a dual timer configured to set the first time delay between the activation of each of the plurality of energetic initiators (20a-c) at 0 seconds.
de_de: , wobei die Flugprofil-Auswahlschaltung optional einen dualen Zeitgeber beinhaltet, der konfiguriert ist, um die erste Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) auf 0 Sekunden einzustellen.

source: 5. The ignition system (12) according to any one of claim 1 to claim 3, wherein the flight profile mode selection input (38) is a flight distance input and the logic circuitry includes a flight profile selection circuit configured to receive the flight distance input and control the second sequential activation of the plurality of energetic initiators (20a-c)
de_de: 5. Zündsystem (12) nach einem der Ansprüche 1 bis 3, wobei die Flugprofilmodus-Auswahleingabe (38) eine Flugdistanzeingabe ist und die Logikschaltung eine Flugprofil-Auswahlschaltung beinhaltet, die konfiguriert ist, um die Flugdistanzeingabe zu empfangen und die zweite sequentielle Aktivierung der Vielzahl von energetischen Zündern (20a-c) zu steuern

source: , wherein optionally the flight profile mode selection circuit includes a dual timer configured to set the second time delay between the activation of each of the plurality of energetic initiators (20a-c) at a predetermined period of time greater than 0 seconds.
de_de: , wobei die Flugprofilmodus-Auswahlschaltung optional einen dualen Zeitgeber beinhaltet, der konfiguriert ist, um die zweite Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) auf eine vorbestimmte Zeitdauer von mehr als 0 Sekunden einzustellen.

source: 6. The ignition system (12) according to any one of claim 4 to claim 5, wherein the flight profile mode selection circuit includes a flight profile mode detector configured to receive the flight profile mode selection input (38).
de_de: 6. Zündsystem (12) nach einem der Ansprüche 4 bis 5, wobei die Flugprofilmodus-Auswahlschaltung einen Flugprofilmodusdetektor beinhaltet, der konfiguriert ist, um die Flugprofilmodus-Auswahleingabe (38) zu empfangen.

source: 7. The ignition system (12) according to any one of claim 1 to claim 6, wherein the logic circuitry includes an ignition inhibition circuit configured to receive at least one missile-generated motor input signal after activation of a first energetic initiator of the plurality of energetic initiators (20a-c) and selectively inhibit activation of a second energetic initiator of the plurality of energetic initiators (20a-c) based on the missile-generated motor input signal
de_de: 7. Zündsystem (12) nach einem der Ansprüche 1 bis 6, wobei die Logikschaltung eine Zündsperrschaltung beinhaltet, die konfiguriert ist, um nach Aktivierung eines ersten energetischen Zünders der Vielzahl von energetischen Zündern (20a-c) mindestens ein von einem Flugkörper erzeugtes Motoreingangssignal zu empfangen und basierend auf dem von dem Flugkörper erzeugten Motoreingangssignal die Aktivierung eines zweiten energetischen Zünders der Vielzahl von energetischen Zündern (20a-c) selektiv zu sperren

source: , wherein optionally the ignition inhibition circuit is activated when the flight profile mode selection input (38) is the flight distance mode selection input.
de_de: , wobei die Zündsperrschaltung optional aktiviert wird, wenn die Flugprofilmodus-Auswahleingabe (38) die Flugdistanzmodus-Auswahleingabe ist.

source: 8. The ignition system (12) according to claim 7, wherein the missile-generated motor input signal is indicative of one or more flight conditions of the missile (10) after activation of the first energetic initiator.
de_de: 8. Zündsystem (12) nach Anspruch 7, wobei das von dem Flugkörper erzeugte Motoreingangssignal einen oder mehrere Flugzustände des Flugkörpers (10) nach Aktivierung des ersten energetischen Zünders angibt.

source: 9. The ignition system (12) according to any one of claim 7 to claim 8, wherein the one or more flight conditions includes an acceleration of the missile (10).
de_de: 9. Das Zündsystem (12) nach einem der Ansprüche 7 bis 8, wobei die eine oder mehreren Flugbedingungen eine Beschleunigung des Flugkörpers (10) beinhalten.

source: The ignition system (12) according to any one of claim 8 to claim 9, wherein the ignition inhibition circuit is configured to inhibit activation of the second energetic initiator when the missile-generated motor input signal is indicative of one or more unstable flight conditions of the missile (10).
de_de: Zündsystem (12) nach einem der Ansprüche 8 bis 9, wobei die Zündsperrschaltung konfiguriert ist, um die Aktivierung des zweiten energetischen Zünders zu sperren, wenn das von dem Flugkörper erzeugte Motoreingangssignal einen oder mehrere instabile Flugzustände des Flugkörpers (10) angibt.

source: A missile (10) comprising:
de_de: Flugkörper (10), umfassend:

source: a plurality of energetic components (16a, 16b); and
de_de: eine Vielzahl von energetischen Komponenten (16a, 16b); und

source: an ignition system (12) for igniting the plurality of energetic components (16a, 16b), the ignition system (12) including:
de_de: ein Zündsystem (12) zum Zünden der Vielzahl von energetischen Komponenten (16a, 16b), wobei das Zündsystem (12) Folgendes beinhaltet:

source: A method of selectively activating a plurality of energetic initiators (20a-c) to ignite a plurality of energetic components (16a, 16b) in a missile (10), the method comprising:
de_de: Verfahren zum selektiven Aktivieren einer Vielzahl von energetischen Zündern (20a-c), um eine Vielzahl energetischer Komponenten (16a, 16b) in einem Flugkörper (10) zu zünden, wobei das Verfahren umfasst:

source: receiving a flight profile mode selection input (38); the method characterised in that it further comprises the steps of
de_de: Empfangen einer Flugprofilmodus-Auswahleingabe (38); wobei das Verfahren dadurch gekennzeichnet ist, dass es ferner die folgenden Schritte umfasst:

source: controlling a first sequential activation of the plurality of energetic initiators (20a-c) when the flight profile mode selection input (38) is a flight velocity mode input, wherein the first sequential activation includes a first time delay between the activation of each of the plurality of energetic initiators (20a-c); and
de_de: Steuern einer ersten sequentiellen Aktivierung der Vielzahl von energetischen Zündern (20a-c), wenn die Flugprofilmodus-Auswahleingabe (38) eine Fluggeschwindigkeitsmoduseingabe ist, wobei die erste sequentielle Aktivierung eine erste Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) beinhaltet; und

source: controlling a second sequential activation of the plurality of energetic initiators (20a-c) when the flight profile mode selection input (38) is a flight distance mode input, wherein the second sequential activation includes a second time delay between the activation of the plurality of energetic initiators (20a-c), the second time delay being greater than the first time delay.
de_de: Steuern einer zweiten sequentiellen Aktivierung der Vielzahl von energetischen Zündern (20a-c), wenn die Flugprofilmodus-Auswahleingabe (38) eine Flugdistanzmoduseingabe ist, wobei die zweite sequentielle Aktivierung eine zweite Zeitverzögerung zwischen der Aktivierung der Vielzahl von energetischen Zündern (20a-c) beinhaltet, wobei die zweite Zeitverzögerung größer ist als die erste Zeitverzögerung.

source: The method according to claim 12, wherein the controlling the first sequential activation includes setting the first time delay between the activation of each of the plurality of energetic initiators (20a-c) at 0 seconds.
de_de: Verfahren gemäß Anspruch 12, wobei das Steuern der ersten sequentiellen Aktivierung das Einstellen der ersten Zeitverzögerung zwischen der Aktivierung jedes der Vielzahl von energetischen Zündern (20a-c) auf 0 Sekunden beinhaltet

source: , or wherein the controlling the second sequential activation includes setting the second time delay between the activation of each of the energetic initiators (20a-c) at a predetermined period of time greater than 0 seconds.
de_de: , oder wobei das Steuern der zweiten sequentiellen Aktivierung das Einstellen der zweiten Zeitverzögerung zwischen der Aktivierung jedes der energetischen Zünder (20a-c) auf eine vorbestimmte Zeitspanne von mehr als 0 Sekunden beinhaltet.

source: The method according to any one of claim 12 to claim 13 further including receiving at least one missile-generated motor input signal indicative of one or more flight conditions of the missile (10) after the activation of a first energetic initiator of the plurality of energetic initiators (20a-c), and selectively inhibiting activation of a second energetic initiator of the plurality of energetic initiators (20a-c) based on the missile-generated motor input signal
de_de: Verfahren nach einem der Ansprüche 12 bis 13 ferner beinhaltend ein Empfangen mindestens eines von dem Flugkörper erzeugten Motoreingangssignals, das einen oder mehrere Flugzustände des Flugkörpers (10) angibt, nach der Aktivierung eines ersten energetischen Zünders der Vielzahl von energetischen Zündern (20a-c), und das selektive Sperren der Aktivierung eines zweiten energetischen Zünders der Vielzahl von energetischen Zündern (20a-c) basierend auf dem von dem Flugkörper erzeugten Motoreingangssignal.

source: The method according to claim 14, wherein the selectively inhibiting activation of the second energetic initiator includes inhibiting activation of the second energetic initiator when the missile-generated motor input signal is indicative of one or more unstable flight conditions of the missile (10).
de_de: Verfahren nach Anspruch 14, wobei das selektive Sperren der Aktivierung des zweiten energetischen Zünders das Sperren der Aktivierung des zweiten energetischen Zünders umfasst, wenn das von dem Flugkörper erzeugte Motoreingangssignal einen oder mehrere instabile Flugzustände des Flugkörpers (10) angibt.

source: A gas turbine engine (10) comprising:
de_de: Gasturbinentriebwerk (10), umfassend:
